app/views/comments/show.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<%= place_comments(comments_hash(@comment.post), @comment.id).join("").html_safe %>