app/helpers/application_helper.rb

    def checked?(id)
        if @post.sub_ids.include?(id)
---
SELECT "subs"."id" FROM "subs" INNER JOIN "postsubs" ON "subs"."id" = "postsubs"."sub_id" WHERE "postsubs"."post_id" = $1  [["post_id", 1]]

    def comments_hash(post)
        comments = Comment.where(post_id: post.id)
        res_hash = Hash.new {|hash, parent_id| hash[parent_id] = []}
        comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]