app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "postsubs" ON "posts"."id" = "postsubs"."post_id" WHERE "postsubs"."sub_id" = $1  [["sub_id", 1]]
---
    <ul>
        <% @sub.posts.each do |post|%>