app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_id", "body", "parent_comment_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 2], ["body", "asdasd"], ["parent_comment_id", 2], ["post_id", 1], ["created_at", "2019-03-05 21:23:24.352063"], ["updated_at", "2019-03-05 21:23:24.352063"]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.author = current_user
        @comment.save