app/controllers/posts_controller.rb

    def update
        @post = Post.find(params[:id])
        @post.sub_ids = params[:post][:sub_ids]
        unless params[:post][:sub_ids].empty? || !@post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" INNER JOIN "postsubs" ON "subs"."id" = "postsubs"."sub_id" WHERE "postsubs"."post_id" = $1  [["post_id", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3 WHERE "posts"."id" = $4  [["title", "title"], ["url", "asd"], ["content", "asdasda"], ["id", 1]]

    def create
        @post = Post.new(post_params)
        @post.sub_ids = params[:post][:sub_ids]
        unless params[:post][:sub_ids].empty? || !@post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdf"], ["url", "asdf"], ["content", "asdf"], ["author_id", 2]]
INSERT INTO "postsubs" ("sub_id", "post_id") VALUES ($1, $2) RETURNING "id"  [["sub_id", 1], ["post_id", 2]]