app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Hello"], ["password_digest", "$2a$10$ffPYNME4GeXrVJ8vT0dITuHrYtOgKR1neGr2fjK.aKpqpsxASvkFu"], ["session_token", "_PpYYCf6MqpYJbkS-Etn4g"]]
---
    def create
        @user = User.new(user_params)
        if @user.save