app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "ZKvKbwWJx8srIw09qxWrNg"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hello"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        u = User.find_by(username: username)